Examinator/src/InformationRegisters/СессииВебКабинетаСУ/СессииВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СессииВебКабинетаСУ</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСессии</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияСессии</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СохраняемоеЗначениеПароля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Права</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеИзученияЭлектронныхКурсовВебКабинетаСУО/ДанныеИзученияЭлектронныхКурсовВебКабинетаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеИзученияЭлектронныхКурсовВебКабинетаСУО</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторАктивности</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлектронныйКурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ЭлектронныеКурсы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Documents/ПрохождениеОбученияСУО/ПрохождениеОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрохождениеОбученияСУО</name>
  <registerRecords>InformationRegister.РасписаниеОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ФайлыНаПроверкуПреподавателюСУО</registerRecords>
  <registerRecords>InformationRegister.УчастникиОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ОценкиКачестваОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.ПрохожденияОбученияСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПрохождение</name>
    <type>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращеноНаДоработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаКачестваОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКачестваОбучения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОцениванияКачестваОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставленаОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Documents/ИзучениеЭлектронногоКурса/ИзучениеЭлектронногоКурса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзучениеЭлектронногоКурса</name>
  <registerRecords>InformationRegister.ИзученныеЭлектронныеКурсы</registerRecords>
  <registerRecords>InformationRegister.ИзученныеЭлементыЭлектронныхКурсов</registerRecords>
  <registerRecords>InformationRegister.ПопыткиИзученияЭлементовЭлектронныхКурсов</registerRecords>
  <registerRecords>InformationRegister.ВыбранныеВариантыОтветовЭлектронныхВопросов</registerRecords>
  <registerRecords>InformationRegister.ОтветыНаТестовыеВопросы</registerRecords>
  <attributes>
    <name>Контекст</name>
    <type>
      <types>DefinedType.КонтекстЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Учащийся</name>
    <type>
      <types>DefinedType.УчащийсяЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйКурс</name>
    <type>
      <types>CatalogRef.ЭлектронныеКурсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеИзучения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПоследнийЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеЭлектронныхКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЭтоТестовоеИзучение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЭтоРежимРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТестировщик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПопыткиИзучения</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеПопытки</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/HTTPServices/ЭлектронныеКурсыБЭО/Module.bsl
Функция ПолучитьДанныеИзученияGET(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//	
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;	
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Ложь);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные запроса
	//	
	
	ИдентификаторАктивности = Новый УникальныйИдентификатор(
		Запрос.ПараметрыURL.Получить("ИдентификаторАктивности"));	
		
	ЭлектронныйКурс = Справочники.ЭлектронныеКурсы.ПолучитьСсылку(
		Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ЭлектронныйКурс")));	
	
	// Получаем данные из БД
	//
	
	ДанныеИзученияСтруктура = РегистрыСведений.ДанныеИзученияЭлектронныхКурсовВебКабинетаСУО.ВсеДанныеИзучения(ИдентификаторАктивности, ЭлектронныйКурс);
	
	// Отдаем клиенту
	//
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеИзученияСтруктура);					
	
	ДанныеИзученияСтрока = ЗаписьJSON.Закрыть();
	
	Возврат ОтветКлиентуСтрокаJSON(ДанныеИзученияСтрока);	
	
КонецФункции

Функция СохранитьДанныеИзученияPOST(Запрос)
	
		
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//	
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;	
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Ложь);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные запроса
	//	
	
	ИдентификаторАктивности = Новый УникальныйИдентификатор(
		Запрос.ПараметрыURL.Получить("ИдентификаторАктивности"));	
		
	ЭлектронныйКурс = Справочники.ЭлектронныеКурсы.ПолучитьСсылку(
		Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ЭлектронныйКурс")));		
	
	ДанныеИзученияСтруктура = ИзучениеЭлектронныхКурсовСлужебный.ДанныеИзученияСтруктураИзСтроки(Запрос.ПолучитьТелоКакСтроку());
	
	Для каждого ЭлементСтруктуры Из ДанныеИзученияСтруктура Цикл
		
		НаборЗаписей = РегистрыСведений.ДанныеИзученияЭлектронныхКурсовВебКабинетаСУО.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторАктивности.Установить(ИдентификаторАктивности);
		НаборЗаписей.Отбор.ЭлектронныйКурс.Установить(ЭлектронныйКурс);
		НаборЗаписей.Отбор.ИмяДанных.Установить(ЭлементСтруктуры.Ключ);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ИдентификаторАктивности = НаборЗаписей.Отбор.ИдентификаторАктивности.Значение; 
		НоваяЗапись.ЭлектронныйКурс = НаборЗаписей.Отбор.ЭлектронныйКурс.Значение;
		НоваяЗапись.ИмяДанных = НаборЗаписей.Отбор.ИмяДанных.Значение;
		
		НоваяЗапись.Данные = Новый ХранилищеЗначения(ЭлементСтруктуры.Значение);
		НоваяЗапись.Пользователь = ДанныеСессии.Пользователь;

		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	ЭтоЗавершениеИзучения = ЭлектронноеОбучениеСлужебныйКлиентСервер.СтрокаВБулево(Запрос.ПараметрыЗапроса.Получить("terminate"));
	
	Если ЭтоЗавершениеИзучения Тогда		
		
		// Формируем данные изучения для помещения в документ изучения
		
		ВсеДанныеИзучения = РегистрыСведений.ДанныеИзученияЭлектронныхКурсовВебКабинетаСУО.ВсеДанныеИзучения(ИдентификаторАктивности, ЭлектронныйКурс);
		
		ДанныеИзученияСтруктура = Новый Структура;
		ДанныеИзученияСтруктура.Вставить("activities", Новый Массив);
		
		Для каждого ЭлементДанных Из ВсеДанныеИзучения Цикл
			
			Если СтрНачинаетсяС(ЭлементДанных.Ключ, "activity_") Тогда
				ДанныеИзученияСтруктура.activities.Добавить(ЭлементДанных.Значение);
			Иначе
				ДанныеИзученияСтруктура.Вставить(ЭлементДанных.Ключ, ЭлементДанных.Значение);
			КонецЕсли;
			
		КонецЦикла;
		
		// Сохраняем документ изучения
		ПрохождениеОбучения = Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(ИдентификаторАктивности);
		ПроведениеОбучения = Документы.ПрохождениеОбученияСУО.ПроведениеОбучения(ПрохождениеОбучения);		
		Контекст = ПроведениеОбучения; 
		ИзучениеЭлектронногоКурса = Документы.ИзучениеЭлектронногоКурса.НайтиПоКонтексту(ЭлектронныйКурс, Контекст, ДанныеСессии.Пользователь);
				
		Если НЕ ЗначениеЗаполнено(ИзучениеЭлектронногоКурса) Тогда
			
			ИзучениеЭлектронногоКурсаОбъект = Документы.ИзучениеЭлектронногоКурса.СоздатьДокумент();
			ИзучениеЭлектронногоКурсаОбъект.Заполнить(Неопределено);
			ИзучениеЭлектронногоКурсаОбъект.Дата = ТекущаяДатаСеанса();
			ИзучениеЭлектронногоКурсаОбъект.Контекст = Контекст;
			ИзучениеЭлектронногоКурсаОбъект.Учащийся = ДанныеСессии.Пользователь;
			ИзучениеЭлектронногоКурсаОбъект.ЭлектронныйКурс = ЭлектронныйКурс;
			
			ИзучениеЭлектронногоКурсаОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			ИзучениеЭлектронногоКурса = ИзучениеЭлектронногоКурсаОбъект.Ссылка;
			
		КонецЕсли;		
		
		ИзучениеЭлектронныхКурсовСлужебный.СохранитьВБазуДанныеИзучения(ИзучениеЭлектронногоКурса, ДанныеИзученияСтруктура, ТекущаяДатаСеанса(), Истина);
		
	КонецЕсли;
	
	Возврат ОтветКлиентуСтрокаJSON("{}");
	
	
КонецФункции


Функция ОтветКлиентуJSON(КодОшибки = "", Данные = NULL)
	
	ТекстСообщенияСтруктура = Новый Структура("error, data", КодОшибки, Данные);
	
	ТекстСообщения = ЭлектронноеОбучениеСлужебный.ДанныеВJSON(ТекстСообщенияСтруктура);

	Если ЗначениеЗаполнено(КодОшибки) Тогда
		Ответ = Новый HTTPСервисОтвет(400);
	Иначе
		Ответ = Новый HTTPСервисОтвет(200);
	КонецЕсли;
		
	Ответ.УстановитьТелоИзСтроки(ТекстСообщения);
	
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	ДобавитьЗаголовкиМежсайтовогоЗапроса(Ответ);

	Возврат Ответ;

	
КонецФункции

Функция ОтветКлиентуСтрокаJSON(СтрокаJSON)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	ДобавитьЗаголовкиМежсайтовогоЗапроса(Ответ);
	
	Возврат Ответ;
	
КонецФункции

Функция РазрешитьМежсайтовыеЗапросыOPTIONS(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	ДобавитьЗаголовкиМежсайтовогоЗапроса(Ответ, Истина);
	Возврат Ответ;
	
КонецФункции

Процедура ДобавитьЗаголовкиМежсайтовогоЗапроса(Ответ, ПроверитьРазрешение = Ложь)
	Если НЕ ПроверитьРазрешение ИЛИ Константы.РазрешитьЗапросыКСервисамСДругихДоменовСУ.Получить() = Истина Тогда
		Ответ.Заголовки.Вставить("Access-Control-Allow-Origin", "*");
	    Ответ.Заголовки.Вставить("Access-Control-Allow-Methods", "GET, PUT, POST, DELETE, HEAD, OPTIONS");
	    Ответ.Заголовки.Вставить("Access-Control-Allow-Credentials", "true");
	    Ответ.Заголовки.Вставить("Access-Control-Allow-Headers", "X-Requested-With, origin, content-type, accept");
	КонецЕсли;
КонецПроцедуры
